<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"43e953e49ee47fadb97ea1317880f38f436592f4ed3fc75a1c89e2d52bcd6345","plan_job_ref":"Job Terraform format and plan #3 at https://github.com/mahesh1b/gha-for-tf/actions/runs/14282829786","plan_out_hash":"bd3ad3ffb86d8eac748187203bd557caefe1833a7703016fc7d773c245f06c7a","plan_hash":"856647f7675d17a69aea97056dccf049c91bfd1a0d38ccae679eb7c62ff63c54","plan_text_format":"diff","version":"1.48.0","closed":true} -->
Terraform plan in __terraform/sandbox__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.tf_state.aws_s3_bucket.this will be created
+   resource "aws_s3_bucket" "this" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
+       arn                         = (known after apply)
+       bucket                      = "test-s3-bucket-for-terraform"
+       bucket_domain_name          = (known after apply)
+       bucket_prefix               = (known after apply)
+       bucket_regional_domain_name = (known after apply)
+       force_destroy               = false
+       hosted_zone_id              = (known after apply)
+       id                          = (known after apply)
+       object_lock_enabled         = (known after apply)
+       policy                      = (known after apply)
+       region                      = (known after apply)
+       request_payer               = (known after apply)
+       tags_all                    = (known after apply)
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)

+       cors_rule (known after apply)

+       grant (known after apply)

+       lifecycle_rule (known after apply)

+       logging (known after apply)

+       object_lock_configuration (known after apply)

+       replication_configuration (known after apply)

+       server_side_encryption_configuration (known after apply)

+       versioning (known after apply)

+       website (known after apply)
    }

  # module.tf_state.aws_s3_bucket_public_access_block.this will be created
+   resource "aws_s3_bucket_public_access_block" "this" {
+       block_public_acls       = true
+       block_public_policy     = true
+       bucket                  = (known after apply)
+       id                      = (known after apply)
+       ignore_public_acls      = true
+       restrict_public_buckets = true
    }

  # module.tf_state.aws_s3_bucket_server_side_encryption_configuration.this will be created
+   resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       rule {
+           apply_server_side_encryption_by_default {
+               sse_algorithm     = "AES256"
#                (1 unchanged attribute hidden)
            }
        }
    }

  # module.tf_state.aws_s3_bucket_versioning.this will be created
+   resource "aws_s3_bucket_versioning" "this" {
+       bucket = (known after apply)
+       id     = (known after apply)

+       versioning_configuration {
+           mfa_delete = (known after apply)
+           status     = "Enabled"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Terraform Apply #1](https://github.com/mahesh1b/gha-for-tf/actions/runs/14282840405)